{"title":"DeGatchi's Articles","url":"https://degatchi.com/articles","favicon":"https://degatchi.com/favicon.ico","elements":[{"contents":"So many MEV bots take money from people but why don't people take money from them? I always thought about this when I was in my web3 cybersec assembly arc. I got quite fascinated with reverse engineering them and the contracts they interected with and realised there are some interesting things you can do with the uniswap code, since it has a few assumptions with the tokens you provide to create the pairs. Although not very practical it's definitely an intereting thought experiment that can provoke some further creativity!","link":"https://degatchi.com/articles/baiting-mev-bots-univ2-token-trapper","retrieved":1734134400000},{"contents":"After spending years in MEV and web3 infosec DeGatchi explains his reasoning behind switching to malware development. Although seemingly less money and entering an alreaedy mature field, it's clearly the most powerful long term decision to be made -- especially when combining malware development with custom evolutionary AI algorithms.","link":"https://degatchi.com/articles/starting-malware-development","retrieved":1733875200000},{"contents":"Machine Learning (ML) and Artificial Intelligence (AI) relies heavily on this very intuitive differentiation-based algorithm called gradient descent. It gets us closer to our desired minima or maxima by starting with a value and adjusting that value based on the change of our gradient. In this article you'll learn to understand what is gradient descent and all the component apart of it. And then explore a few modifications of it from simple to advanced to solidify your understanding!","link":"https://degatchi.com/articles/gradient-descent","retrieved":1732406400000},{"contents":"Who dares enter the darkness to find the light?","link":"https://degatchi.com/articles/seesaw","retrieved":1728259200000},{"contents":"Can Mathematics convert your religious beliefs? I think it's so. Through the power of reason and logic you can get to a new perspective.","link":"https://degatchi.com/articles/deducing-god-exists-with-logic","retrieved":1725926400000},{"contents":"What happens when you combine existential philosophy w/ the background of mathematical mutation-based evolutionary biology? A borderline crazy person or a genius? Who knows! Let's take a look into the mind of DeGatchi as we explore the world of artificial possibilities.","link":"https://degatchi.com/articles/mathematical-evolutionary-philosophy","retrieved":1725840000000},{"contents":"Too often do we obsess over the perfect plan to chase our dreams, resulting in analysis paralysis. Instead of being stuck in this limbo, I've made the perfect plan for anyone to chase their dreams.","link":"https://degatchi.com/articles/the-perfect-plan","retrieved":1725148800000},{"contents":"It's saddening to see 99% of people lose their spark as they reach adulthood. From curious driven children to mindless robots, oh what a world we live in, or should I say exist in for most. If money wasn't an issue what would you do? If you can't answer this then you have a big problem, anon-kun.","link":"https://degatchi.com/articles/dream-a-little","retrieved":1724803200000},{"contents":"When we look at people better than us in a certain something we often don't consider the amount of pain and suffering that person went through to get to that point. A level 3 crook wants to be world-class at something but doesn't go through the torturous regime it takes to get to level 99 and reap the rewards. It's okay, anon-kun. I'm here to eliminate the fog of war and show you the limelight!","link":"https://degatchi.com/articles/learning-is-hard","retrieved":1724716800000},{"contents":"Not getting quadratics? Same! With today's mental gym sesh we're doing leg day, focusing on quadratics. I know, the dreaded quadratic. Fuck them. But we need to understand them to move onto the other cool shit in math. Lets see whether we can get it to click!","link":"https://degatchi.com/articles/understanding-quadratics","retrieved":1723766400000}]}