{"title":"DeGatchi's Articles","url":"https://degatchi.com/articles","favicon":"https://degatchi.com/favicon.ico","elements":[{"title":"The Perfect Plan","contents":"Too often do we obsess over the perfect plan to chase our dreams, resulting in analysis paralysis. Instead of being stuck in this limbo, I've made the perfect plan for anyone to chase their dreams.","link":"https://degatchi.com/articles/the-perfect-plan","retrieved":1725148800000},{"title":"Dream A Little","contents":"It's saddening to see 99% of people lose their spark as they reach adulthood. From curious driven children to mindless robots, oh what a world we live in, or should I say exist in for most. If money wasn't an issue what would you do? If you can't answer this then you have a big problem, anon-kun.","link":"https://degatchi.com/articles/dream-a-little","retrieved":1724803200000},{"title":"Learning Is Hard...","contents":"When we look at people better than us in a certain something we often don't consider the amount of pain and suffering that person went through to get to that point. A level 3 crook wants to be world-class at something but doesn't go through the torturous regime it takes to get to level 99 and reap the rewards. It's okay, anon-kun. I'm here to eliminate the fog of war and show you the limelight!","link":"https://degatchi.com/articles/learning-is-hard","retrieved":1724716800000},{"title":"Unlocking Algebra (WIP)","contents":"Want to learn math but not sure how to start? Feel like you're bad at math? Or maybe, you know different parts of math but there are holes in your mental model. Follow DeGatchi along this ride to get an intuition of how math works algebraically, as he once was 'bad at math' and had completely fragmented mental math models.","link":"https://degatchi.com/articles/unlocking-algebra","retrieved":1722556800000},{"title":"Building A Brand","contents":"One of the most powerful forms of leverage, that lasts a lifetime, is branding. Whether business or personal branding the concepts apply to both. Branding is the association between entity and things you want to relate to. Whether you're an entrepreneur or a person sitting at your desk at 2 am contemplating 'How do I make content', 'I want to express how I feel', 'I need to share my thoughts with the world in hopes someone, anyone, can find me, relate to me in this desolate sphere we call home' then you're in the right place!","link":"https://degatchi.com/articles/build-a-brand","retrieved":1714348800000},{"title":"Leaving For London","contents":"Enter the mind of DeGatchi as he moves continents, once again! Ever wondered what happens in a developer's life? Someone you relate to or look up to? In this article DeGatchi exaplains his rationale for leaving his home country to venture into a new one to start a new life -- all in the name of *blank*...","link":"https://degatchi.com/articles/leaving-for-london","retrieved":1705795200000},{"title":"Swimming Safely In The Public Mempool: MEV Smart Contract Obfuscation Techniques","contents":"In blockchain, generalized frontrunners in MEV abuse the well-known standards of smart contract, therefore obfuscation techniques are essential for MEV operators. Over the past year I've created some zero-day techniques for avoiding these sharks in the mempool of Ethereum and all other existing blockchains in web3. Whether you're a semi-vet like DeGatchi or are just starting in the the MEV world of ETH, you are able to deploy these obfuscation techniques on day 1 to potentially gain an edge on your competition. Godspeed, anon!","link":"https://degatchi.com/articles/mev-smart-contract-obfuscation","retrieved":1705363200000},{"title":"DeGatchi's Life Plan","contents":"Ever wondered what DeGatchi's life looks like or what he wants to accomplish in life? Well, here's an exclusive look into the mysterious mind of DeGatchi. Maybe you'll be inspired, maybe you wont give a single shit, but here it is!","link":"https://degatchi.com/articles/life-plan","retrieved":1698105600000},{"title":"Humanity: The Age Of AI","contents":"Delve into the essence of Artificial Intelligence (AI) and explore its profound implications for humanity in reshaping the modern world. Join us on a visionary journey into the imminent future, where AI stands at the helm of the most significant and transformative era the human race has ever witnessed. With AI's unparalleled potential, we are on the cusp of transcending conventional boundaries, heralding a new chapter of innovation, evolution, and infinite possibilities.","link":"https://degatchi.com/articles/the-age-of-ai","retrieved":1696118400000},{"title":"How To Learn Fast","contents":"Whether you're a beginner developer starting from scratch or an intermediate developer seeking to level up, having an efficient learning strategy in place is crucial. Learning a new topic can unlock a realm of possibilities that can significantly impact the trajectory of your journey. In this article, DeGatchi will explain how he managed to optimize his learning as a self-taught developer with no prior experience, eventually becoming a renowned EVM developer.","link":"https://degatchi.com/articles/how-to-learn-fast","retrieved":1680566400000}]}